gillwei/XMAX_rt1172/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: P8, peripheral: LPUART12, signal: TXD, pin_signal: GPIO_LPSR_06}
  - {pin_num: R8, peripheral: LPUART12, signal: RXD, pin_signal: GPIO_LPSR_07}
  - {pin_num: J15, peripheral: LPSPI4, signal: SCK, pin_signal: GPIO_SD_B2_00}
  - {pin_num: K16, peripheral: LPI2C1, signal: SCL, pin_signal: GPIO_AD_32, software_input_on: Enable, pull_up_down_config: Pull_Up, pull_keeper_select: Keeper, open_drain: Enable}
  - {pin_num: H17, peripheral: LPI2C1, signal: SDA, pin_signal: GPIO_AD_33, software_input_on: Enable, pull_up_down_config: Pull_Up, pull_keeper_select: Keeper, open_drain: Enable}
  - {pin_num: K17, peripheral: CAN2, signal: TX, pin_signal: GPIO_AD_30, pull_up_down_config: Pull_Down, pull_keeper_select: Pull}
  - {pin_num: J17, peripheral: CAN2, signal: RX, pin_signal: GPIO_AD_31, pull_up_down_config: Pull_Up, pull_keeper_select: Pull}
  - {pin_num: H13, peripheral: LPSPI4, signal: SOUT, pin_signal: GPIO_SD_B2_02}
  - {pin_num: R13, peripheral: LPUART7, signal: CTS_B, pin_signal: GPIO_AD_02, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: P15, peripheral: LPUART7, signal: RTS_B, pin_signal: GPIO_AD_03, pull_up_down_config: Pull_Up}
  - {pin_num: R14, peripheral: LPUART7, signal: RXD, pin_signal: GPIO_AD_01, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper}
  - {pin_num: N12, peripheral: LPUART7, signal: TXD, pin_signal: GPIO_AD_00, pull_up_down_config: Pull_Up, pull_keeper_select: Pull, drive_strength: Normal}
  - {pin_num: C15, peripheral: GPIO10, signal: 'gpio_io, 05', pin_signal: GPIO_SD_B1_02, direction: INPUT}
  - {pin_num: D15, peripheral: GPIO10, signal: 'gpio_io, 04', pin_signal: GPIO_SD_B1_01, direction: INPUT, pull_down_pull_up_config: Pull_Up}
  - {pin_num: T8, peripheral: GPIO13, signal: 'gpio_io, 00', pin_signal: WAKEUP, direction: INPUT, gpio_interrupt: kGPIO_IntFallingEdge}
  - {pin_num: T9, peripheral: GPIO13, signal: 'gpio_io, 02', pin_signal: PMIC_STBY_REQ}
  - {pin_num: T17, peripheral: LPADC1, signal: 'B, 1_0', pin_signal: GPIO_AD_07, pull_keeper_select: Keeper}
  - {pin_num: R17, peripheral: GPIO9, signal: 'gpio_io, 09', pin_signal: GPIO_AD_10, direction: INPUT, pull_keeper_select: Keeper}
  - {pin_num: P16, peripheral: GPIO9, signal: 'gpio_io, 10', pin_signal: GPIO_AD_11, direction: INPUT, pull_keeper_select: Keeper}
  - {pin_num: N16, peripheral: GPIO9, signal: 'gpio_io, 26', pin_signal: GPIO_AD_27, identifier: CAN_EN, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: J14, peripheral: GPIO10, signal: 'gpio_io, 10', pin_signal: GPIO_SD_B2_01, direction: OUTPUT}
  - {pin_num: L17, peripheral: GPIO9, signal: 'gpio_io, 27', pin_signal: GPIO_AD_28, direction: OUTPUT}
  - {pin_num: F14, peripheral: LPSPI4, signal: PCS1, pin_signal: GPIO_SD_B2_04}
  - {pin_num: M1, peripheral: GPIO8, signal: 'gpio_io, 14', pin_signal: GPIO_EMC_B2_04, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: N1, peripheral: GPIO8, signal: 'gpio_io, 15', pin_signal: GPIO_EMC_B2_05, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: P1, peripheral: GPIO8, signal: 'gpio_io, 18', pin_signal: GPIO_EMC_B2_08, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: R1, peripheral: GPIO8, signal: 'gpio_io, 13', pin_signal: GPIO_EMC_B2_03, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: M2, peripheral: GPIO8, signal: 'gpio_io, 22', pin_signal: GPIO_EMC_B2_12, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: N2, peripheral: GPIO8, signal: 'gpio_io, 19', pin_signal: GPIO_EMC_B2_09, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: P2, peripheral: GPIO8, signal: 'gpio_io, 26', pin_signal: GPIO_EMC_B2_16, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: R2, peripheral: GPIO8, signal: 'gpio_io, 20', pin_signal: GPIO_EMC_B2_10, direction: INPUT, pull_down_pull_up_config: No_Pull}
  - {pin_num: N17, peripheral: LPADC1, signal: 'A, 1_5', pin_signal: GPIO_AD_16, pull_keeper_select: Keeper}
  - {pin_num: P17, peripheral: LPADC1, signal: 'A, 1_3', pin_signal: GPIO_AD_12, pull_keeper_select: Keeper}
  - {pin_num: R15, peripheral: GPIO9, signal: 'gpio_io, 07', pin_signal: GPIO_AD_08, direction: OUTPUT, gpio_init_state: 'true', pull_up_down_config: Pull_Up}
  - {pin_num: P13, peripheral: GPIO9, signal: 'gpio_io, 04', pin_signal: GPIO_AD_05}
  - {pin_num: B17, peripheral: GPIO10, signal: 'gpio_io, 06', pin_signal: GPIO_SD_B1_03, direction: OUTPUT}
  - {pin_num: T7, peripheral: SRC, signal: 'BOOT_MODE, 01', pin_signal: GPIO_LPSR_03}
  - {pin_num: P6, peripheral: SRC, signal: 'BOOT_MODE, 00', pin_signal: GPIO_LPSR_02}
  - {pin_num: M17, peripheral: FLEXIO2, signal: 'IO, 29', pin_signal: GPIO_AD_29, direction: OUTPUT}
  - {pin_num: B16, peripheral: GPIO10, signal: 'gpio_io, 03', pin_signal: GPIO_SD_B1_00, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: M13, peripheral: GPIO9, signal: 'gpio_io, 03', pin_signal: GPIO_AD_04, direction: OUTPUT}
  - {pin_num: U9, peripheral: SNVS, signal: snvs_lp_pmic_on_req, pin_signal: PMIC_ON_REQ, identifier: ''}
  - {pin_num: B15, peripheral: GPIO10, signal: 'gpio_io, 07', pin_signal: GPIO_SD_B1_04, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */
  CLOCK_EnableClock(kCLOCK_Iomuxc_Lpsr);      /* LPCG on: LPCG is ON. */

  /* GPIO configuration of HW_ID0 on GPIO_EMC_B2_03 (pin R1) */
  gpio_pin_config_t HW_ID0_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_EMC_B2_03 (pin R1) */
  GPIO_PinInit(GPIO8, 13U, &HW_ID0_config);

